evidence/reliability-ops/k6-smoke-local-validation-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/5 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1/5 VUs  0m01.0s/1m00.0s

running (0m02.0s), 1/5 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 1/5 VUs  0m02.0s/1m00.0s

running (0m03.0s), 1/5 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 1/5 VUs  0m03.0s/1m00.0s

running (0m04.0s), 1/5 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 1/5 VUs  0m04.0s/1m00.0s

running (0m05.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 1/5 VUs  0m05.0s/1m00.0s

running (0m06.0s), 2/5 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 2/5 VUs  0m06.0s/1m00.0s

running (0m07.0s), 2/5 VUs, 7 complete and 0 interrupted iterations
default   [  12% ] 2/5 VUs  0m07.0s/1m00.0s

running (0m08.0s), 2/5 VUs, 9 complete and 0 interrupted iterations
default   [  13% ] 2/5 VUs  0m08.0s/1m00.0s

running (0m09.0s), 2/5 VUs, 11 complete and 0 interrupted iterations
default   [  15% ] 2/5 VUs  0m09.0s/1m00.0s

running (0m10.0s), 2/5 VUs, 13 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  0m10.0s/1m00.0s

running (0m11.0s), 3/5 VUs, 15 complete and 0 interrupted iterations
default   [  18% ] 3/5 VUs  0m11.0s/1m00.0s

running (0m12.0s), 3/5 VUs, 18 complete and 0 interrupted iterations
default   [  20% ] 3/5 VUs  0m12.0s/1m00.0s

running (0m13.0s), 3/5 VUs, 21 complete and 0 interrupted iterations
default   [  22% ] 3/5 VUs  0m13.0s/1m00.0s

running (0m14.0s), 3/5 VUs, 24 complete and 0 interrupted iterations
default   [  23% ] 3/5 VUs  0m14.0s/1m00.0s

running (0m15.0s), 3/5 VUs, 27 complete and 0 interrupted iterations
default   [  25% ] 3/5 VUs  0m15.0s/1m00.0s

running (0m16.0s), 4/5 VUs, 30 complete and 0 interrupted iterations
default   [  27% ] 4/5 VUs  0m16.0s/1m00.0s

running (0m17.0s), 4/5 VUs, 34 complete and 0 interrupted iterations
default   [  28% ] 4/5 VUs  0m17.0s/1m00.0s

running (0m18.0s), 4/5 VUs, 38 complete and 0 interrupted iterations
default   [  30% ] 4/5 VUs  0m18.0s/1m00.0s

running (0m19.0s), 4/5 VUs, 42 complete and 0 interrupted iterations
default   [  32% ] 4/5 VUs  0m19.0s/1m00.0s

running (0m20.0s), 4/5 VUs, 46 complete and 0 interrupted iterations
default   [  33% ] 4/5 VUs  0m20.0s/1m00.0s

running (0m21.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  35% ] 5/5 VUs  0m21.0s/1m00.0s

running (0m22.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  37% ] 5/5 VUs  0m22.0s/1m00.0s

running (0m23.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  38% ] 5/5 VUs  0m23.0s/1m00.0s

running (0m24.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  40% ] 5/5 VUs  0m24.0s/1m00.0s

running (0m25.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  42% ] 5/5 VUs  0m25.0s/1m00.0s

running (0m26.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  43% ] 5/5 VUs  0m26.0s/1m00.0s

running (0m27.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  45% ] 5/5 VUs  0m27.0s/1m00.0s

running (0m28.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  47% ] 5/5 VUs  0m28.0s/1m00.0s

running (0m29.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  48% ] 5/5 VUs  0m29.0s/1m00.0s

running (0m30.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  50% ] 5/5 VUs  0m30.0s/1m00.0s

running (0m31.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
default   [  52% ] 5/5 VUs  0m31.0s/1m00.0s

running (0m32.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
default   [  53% ] 5/5 VUs  0m32.0s/1m00.0s

running (0m33.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
default   [  55% ] 5/5 VUs  0m33.0s/1m00.0s

running (0m34.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
default   [  57% ] 5/5 VUs  0m34.0s/1m00.0s

running (0m35.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
default   [  58% ] 5/5 VUs  0m35.0s/1m00.0s

running (0m36.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
default   [  60% ] 5/5 VUs  0m36.0s/1m00.0s

running (0m37.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
default   [  62% ] 5/5 VUs  0m37.0s/1m00.0s

running (0m38.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
default   [  63% ] 5/5 VUs  0m38.0s/1m00.0s

running (0m39.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
default   [  65% ] 5/5 VUs  0m39.0s/1m00.0s

running (0m40.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  0m40.0s/1m00.0s

running (0m41.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
default   [  68% ] 5/5 VUs  0m41.0s/1m00.0s

running (0m42.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
default   [  70% ] 5/5 VUs  0m42.0s/1m00.0s

running (0m43.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  0m43.0s/1m00.0s

running (0m44.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
default   [  73% ] 5/5 VUs  0m44.0s/1m00.0s

running (0m45.0s), 4/5 VUs, 170 complete and 0 interrupted iterations
default   [  75% ] 4/5 VUs  0m45.0s/1m00.0s

running (0m46.0s), 4/5 VUs, 174 complete and 0 interrupted iterations
default   [  77% ] 4/5 VUs  0m46.0s/1m00.0s

running (0m47.0s), 4/5 VUs, 178 complete and 0 interrupted iterations
default   [  78% ] 4/5 VUs  0m47.0s/1m00.0s

running (0m48.0s), 4/5 VUs, 182 complete and 0 interrupted iterations
default   [  80% ] 4/5 VUs  0m48.0s/1m00.0s

running (0m49.0s), 3/5 VUs, 186 complete and 0 interrupted iterations
default   [  82% ] 3/5 VUs  0m49.0s/1m00.0s

running (0m50.0s), 3/5 VUs, 189 complete and 0 interrupted iterations
default   [  83% ] 3/5 VUs  0m50.0s/1m00.0s

running (0m51.0s), 3/5 VUs, 192 complete and 0 interrupted iterations
default   [  85% ] 3/5 VUs  0m51.0s/1m00.0s

running (0m52.0s), 3/5 VUs, 195 complete and 0 interrupted iterations
default   [  87% ] 3/5 VUs  0m52.0s/1m00.0s

running (0m53.0s), 2/5 VUs, 198 complete and 0 interrupted iterations
default   [  88% ] 2/5 VUs  0m53.0s/1m00.0s

running (0m54.0s), 2/5 VUs, 200 complete and 0 interrupted iterations
default   [  90% ] 2/5 VUs  0m54.0s/1m00.0s

running (0m55.0s), 2/5 VUs, 202 complete and 0 interrupted iterations
default   [  92% ] 2/5 VUs  0m55.0s/1m00.0s

running (0m56.0s), 2/5 VUs, 204 complete and 0 interrupted iterations
default   [  93% ] 2/5 VUs  0m56.0s/1m00.0s

running (0m57.0s), 1/5 VUs, 206 complete and 0 interrupted iterations
default   [  95% ] 1/5 VUs  0m57.0s/1m00.0s

running (0m58.0s), 1/5 VUs, 207 complete and 0 interrupted iterations
default   [  97% ] 1/5 VUs  0m58.0s/1m00.0s

running (0m59.0s), 1/5 VUs, 208 complete and 0 interrupted iterations
default   [  98% ] 1/5 VUs  0m59.0s/1m00.0s

running (1m00.0s), 1/5 VUs, 209 complete and 0 interrupted iterations
default   [ 100% ] 1/5 VUs  1m00.0s/1m00.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=6.39ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1050    17.321864/s
    checks_succeeded...: 100.00% 1050 out of 1050
    checks_failed......: 0.00%   0 out of 1050

    ✓ POST /sales -> 201
    ✓ sale is UNPAID
    ✓ total is server-computed (not 0)
    ✓ POST /sales/{id}/pay -> 202
    ✓ GET /sales/{id} -> 200

    HTTP
    http_req_duration..............: avg=2.68ms min=640µs med=1.89ms max=16.13ms p(90)=5.39ms p(95)=6.39ms
      { expected_response:true }...: avg=2.68ms min=640µs med=1.89ms max=16.13ms p(90)=5.39ms p(95)=6.39ms
    http_req_failed................: 0.00%  0 out of 634
    http_reqs......................: 634    10.459107/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s    med=1s     max=1.02s   p(90)=1.01s  p(95)=1.01s 
    iterations.....................: 210    3.464373/s
    vus............................: 1      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 429 kB 7.1 kB/s
    data_sent......................: 329 kB 5.4 kB/s



running (1m00.6s), 0/5 VUs, 210 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  1m0s